TaC = """1. Тир работает по будним дням и, по отдельной договорённости с тренером, по субботам.
2.1 По понедельникам, средам и пятницам время работы с 12.00 до 21.00.
2.2 При отсутствии записей на 19 и позже, тир закрывается по последней записи.
2.3 По вторникам и четвергам время работы с 09.00 до 18.00
2.4 При отсутствии записей* на 11 и раньше, тир открывается по первой записи.
3. При обстоятельствах непреодолимого характера (болезнь тренера, угроза террористической атаки, государственные праздники) или по отдельной договорённости время может изменяться.
Примечание: в 21.00 и 18.00 рубеж должен быть пуст, оборудование собрано и заперто, т.е. крайнее время
для начала тренировки - 20.00 и 17.00 соответственно.
4. Большой рубеж работает всё время секции, малый - до 17.45.
4.1 Малый рубеж устанавливается при записи более 8 человек на 2 и более часа."""
rules = """1. Запись осуществляется через гугл календарь секции (https://calendar.google.com/calendar/embed?src=360o97..).
1.1 Запись так же можно осуществлять с помощью телеграм-бота тира @MSU_Archer_Bot.
2. Доступ к календарю предоставляет Катя Крюк (https://vk.com/kate31105).
2.1 для получения доступа требуется связаться с ней и прислать свой адрес электронной почты, на который будет выслано приглашение в календарь.
3. Запись осуществляется только на целые часы в пределах работы секции.
3.1 На каждый час нужно записываться отдельно (например, если предполагается тренировка с 12:00 до 14:00, то нужно записаться на 12-13 и 13-14 соответственно)
3.2 На один час требуется записываться в одной записи (например, если с 12 до 13 хотят тренироваться А, И, Б, то должна быть одна запись "12-13 А, И, Б", а не три отдельных записи)
4. Запись осуществляется заранее.
4.1 На утренние часы - до 23.00
4.2 На вечерние часы - до 12.00
4.3 Не предварительная запись допускается, если:
- кто-то уже заранее записался и записанных не более 3
- есть согласование с тренером
Например, внезапно отменилась пара и появилась возможность потренироваться. Надо посмотреть в календарь, убедиться, что на освободившееся время есть запись и тир не забит, связаться с тренером и уточнить, можно ли приехать, записаться в календарь... спокойно начать тренироваться.
5. На большом рубеже одновременно могут тренироваться не более 4 человек, на малом - не более 3. Таким образом в тире не может одновременно находиться более 14 человек при двух установленных рубежах и не более 8 в противном случае.
6. В связи с неоднократным недобросовестным использованием календаря, дважды в день на стену группы будет вывешиваться список записавшихся. В спорных случаях приоритет отдаётся тем, кто:
1) согласовал тренировку с тренером
2) записался заранее и есть в записи на стене
3) записан в календарь
Например, в тир пришли А, Б, В, Г и Д. А и Б записаны в календарь и отмечены на стене. А и Б - тренируются. В не отмечен на стене, но он предупредил, что придёт в это время. В тренируется. Г не предупреждал и записался в последний момент, но запись была только о 4 людях, поэтому и Г тренируется. Д пришёл без записи и предупреждения, и в тире уже занят рубеж, поэтому Д будет тренироваться только в то время, когда остальные отдыхают, и не жалуется.
"""
